# KeyError -> Когато в речника не е намерен ключ.
# AttributeError -> Когато се опитваме да изплозваме метод който не се поддържа от променливата.
# ValueError -> При въвеждане на неподходяща стойност.
# NameError -> Използване на несъществуваща променлива.
# TypeError -> При въвеждане на грешен тип данни
# IndexError -> Когато използваното нещо е извън диапазона.
# ModuleNotFoundError -> Когато не е намерен Мдоле.
# ZeroDivisionError -> Пре делене на 0.
# RuntimeError -> Прr наличие на грешка която не е от тип built-in.
# FileNotFoundError -> Когато не е намерен файла, който се опитваме да отворим.
# OSError -> При опит да са отвори файл до който има достъп само администратора.
